Revit 2027 API
Rebar.SetCrankAngledLengthOverride Method
 Sets the crank angled length at the indicated bar end as an override value.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetCrankAngledLengthOverride(
	int end,
	double crankAngledLength
)
Public Sub SetCrankAngledLengthOverride (
	end As Integer,
	crankAngledLength As Double
)
public:
void SetCrankAngledLengthOverride(
	int end,
	double crankAngledLength
)
member SetCrankAngledLengthOverride :
        end : int *
        crankAngledLength : float -> unit
Parameters
end Int32
 The bar end.
crankAngledLength Double
 The crank angled length.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  end must be 0 or 1.
InvalidOperationException |  The bar does not have a valid Rebar Crank Type at the end. -or- The ability to override crank lengths is not enabled for this rebar instance. Use enableCrankLengthOverride(true) to enable it.
Remarks
 When the crank angled length is set, the crank ratio is keeping the same value. The offset length and straight length are adjusted.
See Also
Reference
Rebar Class
Autodesk.Revit.DB.Structure Namespace